bench/results/java21/20260424T144542Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "method": "GET", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "body_file": null, "header_file": null, "requests_per_sec": 6408.96, "p50": "3.57ms", "p95": "6.13ms", "p99": "7.13ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.74ms    1.09ms  30.53ms   72.62%\n    Req/Sec     1.61k   136.49     1.83k    76.10%\n  Latency Distribution\n     50%    3.57ms\n     75%    4.31ms\n     90%    5.14ms\n     99%    7.13ms\n  769292 requests in 2.00m, 175.34MB read\nRequests/sec:   6408.96\nTransfer/sec:      1.46MB"}